{
  "format": "layers-model",
  "generatedBy": "keras v2.2.4",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "keras_version": "2.2.4",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_213",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "kernel_constraint": null,
              "bias_constraint": null,
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l1": 0.0, "l2": 0.0010000000474974513 }
              },
              "activation": "relu",
              "trainable": true,
              "activity_regularizer": null,
              "use_bias": true,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "name": "dense_637",
              "units": 32,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "seed": null,
                  "scale": 1.0,
                  "mode": "fan_avg"
                }
              },
              "batch_input_shape": [null, 4],
              "dtype": "float32",
              "bias_regularizer": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_157",
              "noise_shape": null,
              "seed": null,
              "rate": 0.2,
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "kernel_constraint": null,
              "bias_constraint": null,
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l1": 0.0, "l2": 0.0010000000474974513 }
              },
              "activation": "relu",
              "trainable": true,
              "activity_regularizer": null,
              "use_bias": true,
              "name": "dense_638",
              "units": 32,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "seed": null,
                  "scale": 1.0,
                  "mode": "fan_avg"
                }
              },
              "bias_regularizer": null
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout_158",
              "noise_shape": null,
              "seed": null,
              "rate": 0.2,
              "trainable": true
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "kernel_constraint": null,
              "bias_constraint": null,
              "kernel_regularizer": null,
              "activation": "softmax",
              "trainable": true,
              "activity_regularizer": null,
              "use_bias": true,
              "name": "dense_639",
              "units": 3,
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "uniform",
                  "seed": null,
                  "scale": 1.0,
                  "mode": "fan_avg"
                }
              },
              "bias_regularizer": null
            }
          }
        ]
      }
    },
    "training_config": {
      "weighted_metrics": null,
      "optimizer_config": {
        "class_name": "RMSprop",
        "config": {
          "lr": 0.0010000000474974513,
          "epsilon": 1e-7,
          "rho": 0.8999999761581421,
          "decay": 0.0
        }
      },
      "metrics": ["accuracy"],
      "loss_weights": null,
      "sample_weight_mode": null,
      "loss": "categorical_crossentropy"
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense_637/kernel", "shape": [4, 32], "dtype": "float32" },
        { "name": "dense_637/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense_638/kernel", "shape": [32, 32], "dtype": "float32" },
        { "name": "dense_638/bias", "shape": [32], "dtype": "float32" },
        { "name": "dense_639/kernel", "shape": [32, 3], "dtype": "float32" },
        { "name": "dense_639/bias", "shape": [3], "dtype": "float32" }
      ]
    }
  ]
}
